tutorials/fluids/immersedBoundary/staticCylinderInChannel/constant/fvOptions
/*--------------------------------*- C++ -*----------------------------------*\
| solids4foam: solid mechanics and fluid-solid interaction simulations        |
| Version:     v2.4                                                           |
| Web:         https://solids4foam.github.io                                  |
| Disclaimer:  This offering is not approved or endorsed by OpenCFD Limited,  |
|              producer and distributor of the OpenFOAM software via          |
|              www.openfoam.com, and owner of the OPENFOAM® and OpenCFD®      |
|              trade marks.                                                   |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    location    "constant";
    object      fvOptions;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

// Immersed cylinder, see src/immersedBoundary/README.md
immersedBoundary
{
    type            immersedBoundaryForce;

    // Sharp interface penalisation with the fluid cells next to the
    // surface penalised along the cell links cut by the surface; the other
    // methods are available for comparison with
    //     method          ghostCell;
    //     method          penalty;
    //     method          incremental;
    //     couplingCoeff   0.8;
    // and "occupancy vertexFraction;" for the body with incremental
    method          cutLink;

    // Also write the force from the surface traction (columns 11-13 of the
    // force file)
    writeSurfaceTraction yes;

    bodies
    {
        cylinder
        {
            // Diameter 0.1 m, centred at (0.2, 0.2) m, extending beyond the
            // mesh in the z direction
            surface     "cylinder.stl";
        }
    }
}

// ************************************************************************* //
